app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(nome) LIKE '%test%' OR LOWER(email) LIKE '%test%') ORDER BY "users"."nome" ASC
---
  def index
    @q = params[:q]

    @users = User.order(:nome)

INSERT INTO "users" ("nome", "email", "idade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["nome", "teste"], ["email", "teste@gmail.com"], ["idade", 45], ["created_at", "2026-08-01 12:36:07.998859"], ["updated_at", "2026-08-01 12:36:07.998859"]]
---
  def create # quando clica no botão salvar
    @user = User.new(user_params)

    if @user.save